Tekla Open API Reference for Tekla Structures 2025
CustomPartBase.IsDefaultValue Method
Overload List
Name | Description
IsDefaultValue(Double)
 Returns true if the given value is set to the default value for this type.
IsDefaultValue(Int32)
 Returns true if the given value is set to the default value for this type.
IsDefaultValue(String)
 Returns true if the given value is set to the default value (empty string).
Top
See Also
Reference
CustomPartBase Class
Tekla.Structures.Plugins Namespace